import fun
import numpy
#-*- coding: utf-8 -*-

"""
算法描述：ISODATA算法：
"""
###预定义数据
#------------------------------------------------
#定义数据集
X =  {'X1':(0,0),'X2':(1,1),'X3':(2,2),'X4':(4,3),'X5':(5,3),'X6':(4,4),'X7':(5,4),'X8':(6,5)}
#预期的聚类中心数目
K = 2
#每一聚类域中最少的样本数目
Qn = 1
#一个聚类中样本距离分布的标准差
Qs = 4
#两个聚类中心间的最小距离，若小于，则需要合并
Qc = 4
#一次迭代预算中可以合并的聚类中心的最多对数
L = 1
#迭代的最多次数
I =4
#初始聚类中心Nc = {Nc1,Nc2}
Nc1,Nc2 = (1,1),(5,4)
Nc = 2
if __name__ == "__main__":
    Z = fun.getCluster(X,Nc1,Nc2)
    if [(1 if len(n) >= Qn else 0) for n in Z].count(5): Nc = Nc -1
